<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER a `GROUP BY` based on aggregate criteria 
- `WHERE` is applied for conditions prior to the `GROUP BY`, `HAVING` is applied afterwards

For example, if we had a table of student names and the courses they were taking, we could ask a question such as which classes have 3 or more students with the name Matt?

Such a query would look something like this:

```SQL
SELECT
  class,
  COUNT(student_name) AS number_of_matts
FROM student_courses
WHERE student_name = "Matt"
GROUP BY 1
HAVING COUNT(student_name) >= 3;
```

In [1]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [2]:
columns = [x[0] for x in c.execute('select * from students').description]

In [3]:
columns

['name',
 'birthdate',
 'siblings',
 'birth_place',
 'years_in_nyc',
 'favorite_food']

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?

1. What are the names of all of the students.

In [4]:
import pandas as pd

In [6]:
pd.read_sql_query("""SELECT * FROM students;""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,Sean Abu Wilson,02/06,2,"Birmingham, AL",7.60,guacamole
1,David Miller,06/06,2,"New York, NY",25.75,pizza
2,Abhijeet Kamble,05/07,0,Wardha India,0.50,Biriyani
3,Samantha Jackson,08/04,2,"Newport, RI",12.50,chocolate chip cookies
4,Anmol Srivats,11/19,0,"Bangalore, India",0.05,Sushi
5,Ran Tokman,03/19,2,"Haifa, Israel",8.00,cheesecake
6,Amy Li,12/29,1,"New York, NY",18.00,dumplings
7,Florencia Leoni,06/07,4,"Caracas, Venezuela",1.20,steak
8,Austin Krause,10/22,1,"Lansing, MI",0.17,Everything Bagels
9,Natalie Overchuk,01/02,2,"Kiev, Ukraine",0.10,pasta
10,Akshay Sharma,04/30,2,"New York, NY",24.00,pizza
11,Mohamad Eldebek,01/21,4,"Beirut, Leb",17.00,Tabouleh
12,Adam Dick,05/06,0,"New York, NY",30.00,noodles
13,Menachi Korn,04/11,4,"Denville, N.J.",18.00,falafel
14,Miguel Pe√±a,08/14,4,"Lima, Peru",8.00,rice
15,Atiar Rahman,02/21,2,Bangladesh,22.00,Reeses Puffs
16,Fhel Dimaano,08/20,1,"Manila, Philippines",30.00,Kare Kare
17,Maks Pazuniak,12/19,2,"Wilmington, DE",15.00,pho
18,Alex Mitrani,12/06,1,"New York, NY",28.00,Fusilli Sorrentina
19,Yish Lim,11/21,2,Singapore,5.00,burgers
20,Nicole Roach,06/16,1,"Brooklyn, NY",18.00,steak
21,Omer Hakim,04/30,3,"Haifa, Israel",3.50,Avocado

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

2. Which student has the most siblings?

> This is great place to use a subquery. Encourage students who are initially struggling with a question along the lines of "How could you select the largest number of siblings that anyone has in the group?" From there, you can further push students with a hint if needed: "How can you now make a selection using the result of this, [embedded as a subquery]?"

In [11]:
pd.read_sql_query("""
SELECT * 
FROM students 
WHERE siblings = (SELECT siblings 
                  FROM students 
                  ORDER BY siblings DESC 
                  LIMIT 1);""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,Florencia Leoni,06/07,4,"Caracas, Venezuela",1.2,steak
1,Mohamad Eldebek,01/21,4,"Beirut, Leb",17.0,Tabouleh
2,Menachi Korn,04/11,4,"Denville, N.J.",18.0,falafel
3,Miguel Pe√±a,08/14,4,"Lima, Peru",8.0,rice

In [21]:
pd.read_sql_query("""
SELECT * 
FROM students 
WHERE siblings = (SELECT MAX(siblings)
                  FROM students);""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,Florencia Leoni,06/07,4,"Caracas, Venezuela",1.2,steak
1,Mohamad Eldebek,01/21,4,"Beirut, Leb",17.0,Tabouleh
2,Menachi Korn,04/11,4,"Denville, N.J.",18.0,falafel
3,Miguel Pe√±a,08/14,4,"Lima, Peru",8.0,rice

In [ ]:
c.execute("""
-- YOUR CODE HERE
""").fetchall()

3. How many students are only children?

In [28]:
pd.read_sql_query("""SELECT COUNT(*) FROM students WHERE siblings = 0;""", conn)

   COUNT(*)
0         3

In [ ]:
c.execute("""
-- YOUR CODE HERE
""").fetchone()

4. Which 3 students have lived in NYC the shortest amount of time? (How long has each lived in NYC?)

In [14]:
pd.read_sql_query("""SELECT * FROM students ORDER BY years_in_nyc LIMIT 3;""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,Anmol Srivats,11/19,0,"Bangalore, India",0.05,Sushi
1,Natalie Overchuk,01/02,2,"Kiev, Ukraine",0.10,pasta
2,Austin Krause,10/22,1,"Lansing, MI",0.17,Everything Bagels

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

5. How many students are native New Yorkers?

In [15]:
pd.read_sql_query("""SELECT * FROM students WHERE birth_place = "New York, NY";""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,David Miller,06/06,2,"New York, NY",25.75,pizza
1,Amy Li,12/29,1,"New York, NY",18.00,dumplings
2,Akshay Sharma,04/30,2,"New York, NY",24.00,pizza
3,Adam Dick,05/06,0,"New York, NY",30.00,noodles
4,Alex Mitrani,12/06,1,"New York, NY",28.00,Fusilli Sorrentina

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

6. Do any two students have the same favorite food?

This problem employs the `Having` clause.  Be sure to review the difference between the where and having clause here. (Where filters apply before the group by clause and conditions following the having clause are filters applied after the group by on the resulting aggregate [statistics].) A useful example in doing so, could be to modify the question to something with an additional filtering criterion such as 'do any native new yorkers have the same favorite food?' This would force students to use a where clause prior to the group by to filter the results. Alternatively, see the question below for an alternative but related problem on favorite foods.

In [22]:
pd.read_sql_query("""
SELECT favorite_food, COUNT(*) 
FROM students 
GROUP BY favorite_food 
HAVING COUNT(*) > 1
ORDER BY COUNT(*) DESC;""", conn)

  favorite_food  COUNT(*)
0         pizza         2
1         steak         2

In [30]:
pd.read_sql_query("""
SELECT *
FROM students
WHERE favorite_food IN (SELECT favorite_food 
                        FROM students 
                        GROUP BY favorite_food 
                        HAVING COUNT(*) > 1
                        ORDER BY COUNT(*) DESC)
ORDER BY favorite_food;""", conn)

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,David Miller,06/06,2,"New York, NY",25.75,pizza
1,Akshay Sharma,04/30,2,"New York, NY",24.00,pizza
2,Florencia Leoni,06/07,4,"Caracas, Venezuela",1.20,steak
3,Nicole Roach,06/16,1,"Brooklyn, NY",18.00,steak

In [ ]:
c.execute("""SELECT favorite_food, count(favorite_food)
FROM students
GROUP BY favorite_food
HAVING count(favorite_food) > 1
""").fetchall()

## More Questions

What are the favorite foods of this classroom?

In [23]:
pd.read_sql_query("""
SELECT DISTINCT favorite_food
FROM students;
""", conn)

             favorite_food
0                guacamole
1                    pizza
2                 Biriyani
3   chocolate chip cookies
4                    Sushi
5               cheesecake
6                dumplings
7                    steak
8        Everything Bagels
9                    pasta
10                Tabouleh
11                 noodles
12                 falafel
13                    rice
14            Reeses Puffs
15               Kare Kare
16                     pho
17      Fusilli Sorrentina
18                 burgers
19                 Avocado

In [ ]:
c.execute("""
-- YOUR CODE HERE
""").fetchall()

7. Which student was born closest to the cohort's graduation date?

In [26]:
df = pd.read_sql_query("""SELECT * FROM students ORDER BY birthdate;""", conn)

In [27]:
df

,name,birthdate,siblings,birth_place,years_in_nyc,favorite_food
0,Natalie Overchuk,01/02,2,"Kiev, Ukraine",0.10,pasta
1,Mohamad Eldebek,01/21,4,"Beirut, Leb",17.00,Tabouleh
2,Sean Abu Wilson,02/06,2,"Birmingham, AL",7.60,guacamole
3,Atiar Rahman,02/21,2,Bangladesh,22.00,Reeses Puffs
4,Ran Tokman,03/19,2,"Haifa, Israel",8.00,cheesecake
5,Menachi Korn,04/11,4,"Denville, N.J.",18.00,falafel
6,Akshay Sharma,04/30,2,"New York, NY",24.00,pizza
7,Omer Hakim,04/30,3,"Haifa, Israel",3.50,Avocado
8,Adam Dick,05/06,0,"New York, NY",30.00,noodles
9,Abhijeet Kamble,05/07,0,Wardha India,0.50,Biriyani
10,David Miller,06/06,2,"New York, NY",25.75,pizza
11,Florencia Leoni,06/07,4,"Caracas, Venezuela",1.20,steak
12,Nicole Roach,06/16,1,"Brooklyn, NY",18.00,steak
13,Samantha Jackson,08/04,2,"Newport, RI",12.50,chocolate chip cookies
14,Miguel Pe√±a,08/14,4,"Lima, Peru",8.00,rice
15,Fhel Dimaano,08/20,1,"Manila, Philippines",30.00,Kare Kare
16,Austin Krause,10/22,1,"Lansing, MI",0.17,Everything Bagels
17,Anmol Srivats,11/19,0,"Bangalore, India",0.05,Sushi
18,Yish Lim,11/21,2,Singapore,5.00,burgers
19,Alex Mitrani,12/06,1,"New York, NY",28.00,Fusilli Sorrentina
20,Maks Pazuniak,12/19,2,"Wilmington, DE",15.00,pho
21,Amy Li,12/29,1,"New York, NY",18.00,dumplings

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()